Revit API Introduction Labs
Lab3_2_LoadStandardFamilies Class
 Load an entire family or a specific type from a family.
 This lab shows how to load a new entire family or a single family instance into the current document. The document object provides straightforward methods to load either a whole RFA file or just a specific symbol from it. The file and symbol name to load are defined by the LabConstants class. You may need to change the paths and family names to make sure the RFA files and the corresponding TXT catalog files exist on your machine.
Loading an entire family:
CopyC#
// Load a whole Family
//
// Example for a family WITH TXT file:
rc = doc.LoadFamily( LabConstants.WholeFamilyFileToLoad1 );
CopyVB.NET
' Load a whole Family
'
' Example for a family WITH TXT file:
rc = doc.LoadFamily(LabConstants.WholeFamilyFileToLoad1)
Loading an individual type:
CopyC#
// Load only a specific symbol (type):
rc = doc.LoadFamilySymbol(
  LabConstants.FamilyFileToLoadSingleSymbol,
  LabConstants.SymbolName );
CopyVB.NET
' Load only a specific symbol (type):
rc = doc.LoadFamilySymbol( _
    LabConstants.FamilyFileToLoadSingleSymbol, _
    LabConstants.SymbolName)
 Namespace: Labs
 Assembly: labs (in labs.dll) Version: 3.0.0.1 (3.0.0.1)
Syntax
C#
public class Lab3_2_LoadStandardFamilies : IExternalCommand
Visual Basic (Declaration)
Public Class Lab3_2_LoadStandardFamilies _
	Implements IExternalCommand
Visual C++
public ref class Lab3_2_LoadStandardFamilies : IExternalCommand
Inheritance Hierarchy
System.Object
 Labs.Lab3_2_LoadStandardFamilies
See Also
Lab3_2_LoadStandardFamilies Members
Labs Namespace